config/pen/documents/notes/ws/discipleship-group/weekly-journal/2024-week-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-12 Fri 12:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>D-Group journal weekly entry for 2024, week 2</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">D-Group journal weekly entry for 2024, week 2</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4c11650">1. D-Group weekly session notes</a>
<ul>
<li><a href="#orgb00a1c5">1.1. H.E.A.R journal entry for verse Luke 6:9</a>
<ul>
<li><a href="#org3564282">1.1.1. H ([h]ighlight a verse that stood out in the reading)</a></li>
<li><a href="#org062f356">1.1.2. E ([e]xplain the context of the verse and what the writer/people in the story may have been experiencing when they wrote/experienced it)</a></li>
<li><a href="#org3647b4d">1.1.3. A (write down how I can [a]pply this Bible verse in my own life)</a></li>
<li><a href="#org33e3ac2">1.1.4. R ([r]espond to the LORD in prayer)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0627060">2. </a></li>
<li><a href="#orgddf488b">3. </a>
<ul>
<li><a href="#org762a4ca">3.1. H.E.A.R journal entry for verse Luke 6:26</a>
<ul>
<li><a href="#orgde154e6">3.1.1. H ([h]ighlight a verse that stood out in the reading)</a></li>
<li><a href="#org3690432">3.1.2. E ([e]xplain the context of the verse and what the writer/people in the story may have been experiencing when they wrote/experienced it)</a></li>
<li><a href="#org8da02c1">3.1.3. A (write down how I can [a]pply this Bible verse in my own life)</a></li>
<li><a href="#orge6ad2f6">3.1.4. R ([r]espond to the LORD in prayer)</a></li>
</ul>
</li>
<li><a href="#org02a7c56">3.2. H.E.A.R journal entry for verse Luke 6:31</a>
<ul>
<li><a href="#orgde57718">3.2.1. H ([h]ighlight a verse that stood out in the reading)</a></li>
<li><a href="#orgd87cd2d">3.2.2. E ([e]xplain the context of the verse and what the writer/people in the story may have been experiencing when they wrote/experienced it)</a></li>
<li><a href="#org72cdccb">3.2.3. A (write down how I can [a]pply this Bible verse in my own life)</a></li>
<li><a href="#org1d6f2f7">3.2.4. R ([r]espond to the LORD in prayer)</a></li>
</ul>
</li>
<li><a href="#org20923e0">3.3. H.E.A.R journal entry for verse Luke 6:37</a>
<ul>
<li><a href="#orgb3a8d4e">3.3.1. H ([h]ighlight a verse that stood out in the reading)</a></li>
<li><a href="#orgec96aec">3.3.2. E ([e]xplain the context of the verse and what the writer/people in the story may have been experiencing when they wrote/experienced it)</a></li>
<li><a href="#org85ff3a2">3.3.3. A (write down how I can [a]pply this Bible verse in my own life)</a></li>
<li><a href="#orgf6e05b3">3.3.4. R ([r]espond to the LORD in prayer)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4c11650" class="outline-2">
<h2 id="org4c11650"><span class="section-number-2">1.</span> D-Group weekly session notes</h2>
<div class="outline-text-2" id="text-1">
<p>
Started working on it: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-01-11 Thu&gt;</span></span>
</p>

<p>
Listen to instrumental worship music:
<a href="https://www.youtube.com/watch?v=YiZdqotstAk">Lead Me Lord : Piano Instrumental Music With Scriptures &amp; Autumn Scene d???CHRISTIAN piano - YouTube</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Scripture Memory</th>
<th scope="col" class="org-left">HEAR Journals Passage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="sps bible-read-passage nasb Matthew 5:3-4 ">Matthew 5:3-4</a></td>
<td class="org-left"><a href="sps nasb Luke 6-10 ">Luke 6-10</a></td>
</tr>
</tbody>
</table>

<p>
While doing the reading, write bullet points about the story.
Take note of verses which stand out to me and think about what
the writer may have been experiencing when they wrote those verses.
Keep in mind the context of the verse.
</p>

<p>
Story bullet points (over entire reading):
</p>
<ul class="org-ul">
<li>On two separate Sabbaths
<ul class="org-ul">
<li>Jesus was passing through some grainfields on a Sabbath and his disciples were eating from the grainfields. Jesus brought up how David and his followers ate from the consecrated bread</li>
<li>Jesus healed a man with a withered right hand</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span class="linenr">1: </span>Luke 6:9
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">Luke 6:9
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
And Jesus said to them, &#8220;I ask you, is it
lawful to do good or to do harm on the
Sabbath, to save a life or to destroy it?&#8221;

(NASB)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><span class="linenr">1: </span>Matthew 5:3-4
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">Matthew 5:3
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
&#8220;Blessed are the poor in spirit, for theirs is
the kingdom of heaven.

Matthew 5:4
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
&#8220;Blessed are those who mourn, for they shall be
comforted.

(NASB)
</pre>
</div>

<p>
Go over the reading and make hear journal entries for any verses
that stood out for me.
</p>
</div>

<div id="outline-container-orgb00a1c5" class="outline-3">
<h3 id="orgb00a1c5"><span class="section-number-3">1.1.</span> H.E.A.R journal entry for verse <a href="sps nasb Luke 6:9 ">Luke 6:9</a></h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org3564282" class="outline-4">
<h4 id="org3564282"><span class="section-number-4">1.1.1.</span> H ([h]ighlight a verse that stood out in the reading)</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-bash"><span class="linenr">1: </span>nasb Luke 6:9
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">Luke 6:9
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
And Jesus said to them, &#8220;I ask you, is it
lawful to do good or to do harm on the
Sabbath, to save a life or to destroy it?&#8221;

(NASB)
</pre>
</div>
</div>
</div>

<div id="outline-container-org062f356" class="outline-4">
<h4 id="org062f356"><span class="section-number-4">1.1.2.</span> E ([e]xplain the context of the verse and what the writer/people in the story may have been experiencing when they wrote/experienced it)</h4>
</div>

<div id="outline-container-org3647b4d" class="outline-4">
<h4 id="org3647b4d"><span class="section-number-4">1.1.3.</span> A (write down how I can [a]pply this Bible verse in my own life)</h4>
</div>

<div id="outline-container-org33e3ac2" class="outline-4">
<h4 id="org33e3ac2"><span class="section-number-4">1.1.4.</span> R ([r]espond to the LORD in prayer)</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Dear Heavenly Father, Almighty Jehovah God,
please help me to follow the law the way Jesus Christ did, in the spirit of the law; doing good and loving You and loving other people.
Thank You God for justifying us through the righteousness of faith in Jesus.
I believe You, Father God, that You sent Jesus Christ to die for my sins.
I believe You, Father God, that Jesus Christ was raised the dead.
Father God, I believe Jesus that I too may be raised from the dead, as Jesus was.
Thank You that Jesus Christ, Your Son fulfilled the law at the prophets.
In Jesus Christ's name I pray and thank You, God,
AMEN!!
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org0627060" class="outline-2">
<h2 id="org0627060"><span class="section-number-2">2.</span> </h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="/volumes/home/shane/notes/ws/bible-studies/my-testimony.org">/volumes/home/shane/notes/ws/bible-studies/my-testimony.org</a>
</p>
</div>
</div>

<div id="outline-container-orgddf488b" class="outline-2">
<h2 id="orgddf488b"><span class="section-number-2">3.</span> </h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="agenda/Rudy::Review book for Rudy: And He Will">agenda/Rudy::Review book for Rudy: And He Will</a>
</p>
</div>

<div id="outline-container-org762a4ca" class="outline-3">
<h3 id="org762a4ca"><span class="section-number-3">3.1.</span> H.E.A.R journal entry for verse <a href="sps nasb Luke 6:26 ">Luke 6:26</a></h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgde154e6" class="outline-4">
<h4 id="orgde154e6"><span class="section-number-4">3.1.1.</span> H ([h]ighlight a verse that stood out in the reading)</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-bash"><span class="linenr">1: </span>nasb Luke 6:26
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">Luke 6:26
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
Woe to you when all men speak well of you, for
their fathers used to treat the false prophets
in the same way.

(NASB)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3690432" class="outline-4">
<h4 id="org3690432"><span class="section-number-4">3.1.2.</span> E ([e]xplain the context of the verse and what the writer/people in the story may have been experiencing when they wrote/experienced it)</h4>
</div>

<div id="outline-container-org8da02c1" class="outline-4">
<h4 id="org8da02c1"><span class="section-number-4">3.1.3.</span> A (write down how I can [a]pply this Bible verse in my own life)</h4>
</div>

<div id="outline-container-orge6ad2f6" class="outline-4">
<h4 id="orge6ad2f6"><span class="section-number-4">3.1.4.</span> R ([r]espond to the LORD in prayer)</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Dear Heavenly Father, Almighty Jehovah God,
</p>
</div>
</div>
</div>

<div id="outline-container-org02a7c56" class="outline-3">
<h3 id="org02a7c56"><span class="section-number-3">3.2.</span> H.E.A.R journal entry for verse <a href="sps nasb Luke 6:31 ">Luke 6:31</a></h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgde57718" class="outline-4">
<h4 id="orgde57718"><span class="section-number-4">3.2.1.</span> H ([h]ighlight a verse that stood out in the reading)</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-bash"><span class="linenr">1: </span>nasb Luke 6:31
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">Luke 6:31
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
Treat others the same way you want them to
treat you.

(NASB)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd87cd2d" class="outline-4">
<h4 id="orgd87cd2d"><span class="section-number-4">3.2.2.</span> E ([e]xplain the context of the verse and what the writer/people in the story may have been experiencing when they wrote/experienced it)</h4>
</div>

<div id="outline-container-org72cdccb" class="outline-4">
<h4 id="org72cdccb"><span class="section-number-4">3.2.3.</span> A (write down how I can [a]pply this Bible verse in my own life)</h4>
</div>

<div id="outline-container-org1d6f2f7" class="outline-4">
<h4 id="org1d6f2f7"><span class="section-number-4">3.2.4.</span> R ([r]espond to the LORD in prayer)</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
Dear Heavenly Father, Almighty Jehovah God,
</p>
</div>
</div>
</div>

<div id="outline-container-org20923e0" class="outline-3">
<h3 id="org20923e0"><span class="section-number-3">3.3.</span> H.E.A.R journal entry for verse <a href="sps nasb Luke 6:37 ">Luke 6:37</a></h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-orgb3a8d4e" class="outline-4">
<h4 id="orgb3a8d4e"><span class="section-number-4">3.3.1.</span> H ([h]ighlight a verse that stood out in the reading)</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-bash"><span class="linenr">1: </span>nasb Luke 6:37
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">Luke 6:37
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
&#8220;Do not judge, and you will not be judged; and
do not condemn, and you will not be condemned;
pardon, and you will be pardoned.

(NASB)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec96aec" class="outline-4">
<h4 id="orgec96aec"><span class="section-number-4">3.3.2.</span> E ([e]xplain the context of the verse and what the writer/people in the story may have been experiencing when they wrote/experienced it)</h4>
</div>

<div id="outline-container-org85ff3a2" class="outline-4">
<h4 id="org85ff3a2"><span class="section-number-4">3.3.3.</span> A (write down how I can [a]pply this Bible verse in my own life)</h4>
</div>

<div id="outline-container-orgf6e05b3" class="outline-4">
<h4 id="orgf6e05b3"><span class="section-number-4">3.3.4.</span> R ([r]espond to the LORD in prayer)</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
Dear Heavenly Father, Almighty Jehovah God,
Please forgive me for judging and condemning people.
I do not judge, nor condemn.
I'm thinking particularly of the situation this week with Cornerstone.
Please, God, forgive me for getting angry.
I do not condemn them, LORD.
Please, God, they may simply have some error there.
But I do not condemn them.
You are the only just and righteous Judge, LORD God.
In Jesus Christ's name I ask, pray and declare,
AMEN!!
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2024-01-12 Fri 12:07</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>